Ran Plan for 3 projects:

1. project: `kms-prod` dir: `terraform/kms` workspace: `default`
1. project: `network-prod` dir: `terraform/network` workspace: `default`
1. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
---

### 1. project: `kms-prod` dir: `terraform/kms` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_kms_alias.elasticache will be created
+ resource "aws_kms_alias" "elasticache" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/elasticache-encryption"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.s3 will be created
+ resource "aws_kms_alias" "s3" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-encryption"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.sqs will be created
+ resource "aws_kms_alias" "sqs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/sqs-encryption"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.ssm will be created
+ resource "aws_kms_alias" "ssm" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/ssm-encryption"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.elasticache will be created
+ resource "aws_kms_key" "elasticache" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for ElastiCache cluster encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Component"   = "elasticache"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "elasticache-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all                           = {
          + "Component"   = "elasticache"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "elasticache-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
    }

  # aws_kms_key.s3 will be created
+ resource "aws_kms_key" "s3" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for S3 bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow S3 to use the key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Component"   = "s3"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "s3-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all                           = {
          + "Component"   = "s3"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "s3-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
    }

  # aws_kms_key.sqs will be created
+ resource "aws_kms_key" "sqs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for SQS queue encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sqs.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow SQS to use the key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Component"   = "sqs"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sqs-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all                           = {
          + "Component"   = "sqs"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sqs-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
    }

  # aws_kms_key.ssm will be created
+ resource "aws_kms_key" "ssm" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for SSM Parameter Store encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Component"   = "ssm"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all                           = {
          + "Component"   = "ssm"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
    }

  # aws_ssm_parameter.cloudwatch-logs-key-arn will be created
+ resource "aws_ssm_parameter" "cloudwatch-logs-key-arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CloudWatch Logs KMS key ARN for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/kms/cloudwatch-logs-key-arn"
      + tags           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cloudwatch-logs-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cloudwatch-logs-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.ecs-secrets-key-arn will be created
+ resource "aws_ssm_parameter" "ecs-secrets-key-arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECS Secrets KMS key ARN for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/kms/ecs-secrets-key-arn"
      + tags           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecs-secrets-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecs-secrets-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.elasticache-key-arn will be created
+ resource "aws_ssm_parameter" "elasticache-key-arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ElastiCache KMS key ARN for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/kms/elasticache-key-arn"
      + tags           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "elasticache-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "elasticache-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.rds-key-arn will be created
+ resource "aws_ssm_parameter" "rds-key-arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "RDS KMS key ARN for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/kms/rds-key-arn"
      + tags           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rds-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rds-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.s3-key-arn will be created
+ resource "aws_ssm_parameter" "s3-key-arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "S3 KMS key ARN for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/kms/s3-key-arn"
      + tags           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "s3-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "s3-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets-manager-key-arn will be created
+ resource "aws_ssm_parameter" "secrets-manager-key-arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Secrets Manager KMS key ARN for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/kms/secrets-manager-key-arn"
      + tags           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "secrets-manager-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "secrets-manager-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs-key-arn will be created
+ resource "aws_ssm_parameter" "sqs-key-arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "SQS KMS key ARN for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/kms/sqs-key-arn"
      + tags           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sqs-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sqs-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.ssm-key-arn will be created
+ resource "aws_ssm_parameter" "ssm-key-arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "SSM Parameter Store KMS key ARN for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/kms/ssm-key-arn"
      + tags           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-key-arn-export"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "kms"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p kms-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fkms%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p kms-prod
  ```
Plan: 16 to add, 0 to change, 0 to destroy.

---
### 2. project: `network-prod` dir: `terraform/network` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ec2_transit_gateway.main[0] will be created
+ resource "aws_ec2_transit_gateway" "main" {
      + amazon_side_asn                    = 64512
      + arn                                = (known after apply)
      + association_default_route_table_id = (known after apply)
      + auto_accept_shared_attachments     = "disable"
      + default_route_table_association    = "enable"
      + default_route_table_propagation    = "enable"
      + description                        = "Transit Gateway for prod environment"
      + dns_support                        = "enable"
      + id                                 = (known after apply)
      + multicast_support                  = "disable"
      + owner_id                           = (known after apply)
      + propagation_default_route_table_id = (known after apply)
      + security_group_referencing_support = "disable"
      + tags                               = {
          + "Component"   = "shared-infrastructure"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "prod-transit-gateway"
          + "Owner"       = "platform-team"
          + "Service"     = "network"
        }
      + tags_all                           = {
          + "Component"   = "shared-infrastructure"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-transit-gateway"
          + "Owner"       = "platform-team"
          + "Project"     = "minji"
          + "Service"     = "network"
        }
      + vpn_ecmp_support                   = "enable"
    }

  # aws_ec2_transit_gateway_vpc_attachment.main[0] will be created
+ resource "aws_ec2_transit_gateway_vpc_attachment" "main" {
      + appliance_mode_support                          = "disable"
      + arn                                             = (known after apply)
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + security_group_referencing_support              = (known after apply)
      + subnet_ids                                      = [
          + "subnet-09692620519f86cf0",
          + "subnet-0d99080cbe134b6e9",
        ]
      + tags                                            = {
          + "Component"   = "shared-infrastructure"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "prod-vpc-tgw-attachment"
          + "Owner"       = "platform-team"
          + "Service"     = "network"
        }
      + tags_all                                        = {
          + "Component"   = "shared-infrastructure"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-vpc-tgw-attachment"
          + "Owner"       = "platform-team"
          + "Project"     = "minji"
          + "Service"     = "network"
        }
      + transit_gateway_default_route_table_association = true
      + transit_gateway_default_route_table_propagation = true
      + transit_gateway_id                              = (known after apply)
      + vpc_id                                          = "vpc-0f162b9e588276e09"
      + vpc_owner_id                                    = (known after apply)
    }

  # aws_ssm_parameter.private-subnet-ids will be created
+ resource "aws_ssm_parameter" "private-subnet-ids" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Private subnet IDs for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/network/private-subnet-ids"
      + tags           = {
          + "Component"   = "network"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "private-subnet-ids-export"
          + "Owner"       = "platform-team"
          + "Service"     = "network"
        }
      + tags_all       = {
          + "Component"   = "network"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "private-subnet-ids-export"
          + "Owner"       = "platform-team"
          + "Project"     = "minji"
          + "Service"     = "network"
        }
      + tier           = (known after apply)
      + type           = "StringList"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.public-subnet-ids will be created
+ resource "aws_ssm_parameter" "public-subnet-ids" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Public subnet IDs for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/network/public-subnet-ids"
      + tags           = {
          + "Component"   = "network"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "public-subnet-ids-export"
          + "Owner"       = "platform-team"
          + "Service"     = "network"
        }
      + tags_all       = {
          + "Component"   = "network"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "public-subnet-ids-export"
          + "Owner"       = "platform-team"
          + "Project"     = "minji"
          + "Service"     = "network"
        }
      + tier           = (known after apply)
      + type           = "StringList"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.vpc-id will be created
+ resource "aws_ssm_parameter" "vpc-id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "VPC ID for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/network/vpc-id"
      + tags           = {
          + "Component"   = "network"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "vpc-id-export"
          + "Owner"       = "platform-team"
          + "Service"     = "network"
        }
      + tags_all       = {
          + "Component"   = "network"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-id-export"
          + "Owner"       = "platform-team"
          + "Project"     = "minji"
          + "Service"     = "network"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ transit_gateway_arn               = (known after apply)
+ transit_gateway_id                = (known after apply)
+ transit_gateway_route_table_id    = (known after apply)
+ transit_gateway_vpc_attachment_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p network-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fnetwork%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p network-prod
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
### 3. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/57/default/terraform/ecr/fileflow/ecr-fileflow-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/57/default/terraform/ecr/fileflow": exit status 1
data.aws_ssm_parameter.ecs_secrets_key_arn: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: reading SSM Parameter (/shared/kms/ecs-secrets-key-arn): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 015669c8-bfbc-4010-8a83-a3df97692e57, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/6085d887dc454339970d4535ab6315fe is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:ap-northeast-2:646886795421:parameter/shared/kms/ecs-secrets-key-arn because no identity-based policy allows the ssm:GetParameter action
│ 
│   with data.aws_ssm_parameter.ecs_secrets_key_arn,
│   on data.tf line 5, in data "aws_ssm_parameter" "ecs_secrets_key_arn":
│    5: data "aws_ssm_parameter" "ecs_secrets_key_arn" {
│ 
╵


```
</details>

---
### Plan Summary

3 projects, 2 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```